results/cpu-vs-latency/memcached/25-1/nsl206.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1878475 ops,   62706 (avg:   62615) ops/sec, 2.31MB/sec (avg: 2.31MB/sec),  0.40 (avg:  0.40) msec latency

1         Threads
25        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        5692.68          ---          ---      0.40000       416.94
Gets       56922.90     55781.37      1141.53      0.39600      1945.61
Totals     62615.58     55781.37      1141.53      0.39600      2362.55


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     99.94086
SET       2.000     99.99473
SET       3.000     99.99824
SET       4.000    100.00000
---
GET       0.068      0.00006
GET       0.069      0.00012
GET       0.074      0.00018
GET       0.075      0.00029
GET       0.077      0.00035
GET       0.078      0.00041
GET       0.079      0.00059
GET       0.080      0.00064
GET       0.081      0.00070
GET       0.082      0.00094
GET       0.085      0.00111
GET       0.087      0.00135
GET       0.088      0.00182
GET       0.089      0.00211
GET       0.090      0.00246
GET       0.091      0.00281
GET       0.092      0.00316
GET       0.093      0.00375
GET       0.094      0.00427
GET       0.095      0.00504
GET       0.096      0.00586
GET       0.097      0.00668
GET       0.098      0.00732
GET       0.099      0.00808
GET       0.100      0.01265
GET       0.110      0.02910
GET       0.120      0.05171
GET       0.130      0.09047
GET       0.140      0.16379
GET       0.150      0.30925
GET       0.160      0.56737
GET       0.170      1.01294
GET       0.180      1.71852
GET       0.190      2.79588
GET       0.200      4.37227
GET       0.210      6.43593
GET       0.220      9.00518
GET       0.230     12.06756
GET       0.240     15.59114
GET       0.250     19.52510
GET       0.260     23.71285
GET       0.270     28.10117
GET       0.280     32.60649
GET       0.290     37.09271
GET       0.300     41.56137
GET       0.310     45.82999
GET       0.320     49.90150
GET       0.330     53.71150
GET       0.340     57.22401
GET       0.350     60.37118
GET       0.360     63.18175
GET       0.370     65.65673
GET       0.380     67.87434
GET       0.390     69.87962
GET       0.400     71.71835
GET       0.410     73.45672
GET       0.420     75.10661
GET       0.430     76.69178
GET       0.440     78.21770
GET       0.450     79.66539
GET       0.460     81.02213
GET       0.470     82.26550
GET       0.480     83.38953
GET       0.490     84.40306
GET       0.500     85.27664
GET       0.510     86.04926
GET       0.520     86.70816
GET       0.530     87.26458
GET       0.540     87.75026
GET       0.550     88.17839
GET       0.560     88.55304
GET       0.570     88.88489
GET       0.580     89.19197
GET       0.590     89.47756
GET       0.600     89.74424
GET       0.610     90.00980
GET       0.620     90.25674
GET       0.630     90.49443
GET       0.640     90.73247
GET       0.650     90.95980
GET       0.660     91.17523
GET       0.670     91.38821
GET       0.680     91.59914
GET       0.690     91.80632
GET       0.700     92.00518
GET       0.710     92.20914
GET       0.720     92.40965
GET       0.730     92.61460
GET       0.740     92.81376
GET       0.750     93.00970
GET       0.760     93.20042
GET       0.770     93.38664
GET       0.780     93.57350
GET       0.790     93.75310
GET       0.800     93.92508
GET       0.810     94.09426
GET       0.820     94.26531
GET       0.830     94.43044
GET       0.840     94.58709
GET       0.850     94.73881
GET       0.860     94.87806
GET       0.870     95.02130
GET       0.880     95.14931
GET       0.890     95.28270
GET       0.900     95.40878
GET       0.910     95.52730
GET       0.920     95.64149
GET       0.930     95.74754
GET       0.940     95.85049
GET       0.950     95.94922
GET       0.960     96.04455
GET       0.970     96.13321
GET       0.980     96.21976
GET       0.990     96.29863
GET       1.000     96.66744
GET       1.100     97.17086
GET       1.200     97.60314
GET       1.300     98.05029
GET       1.400     98.52356
GET       1.500     98.96047
GET       1.600     99.30995
GET       1.700     99.57984
GET       1.800     99.75716
GET       1.900     99.86614
GET       2.000     99.92967
GET       2.100     99.96656
GET       2.200     99.98155
GET       2.300     99.98882
GET       2.400     99.99209
GET       2.500     99.99344
GET       2.600     99.99391
GET       2.700     99.99420
GET       2.800     99.99432
GET       2.900     99.99485
GET       3.000     99.99526
GET       3.100     99.99590
GET       3.200     99.99614
GET       3.700     99.99643
GET       3.800     99.99666
GET       3.900     99.99672
GET       4.100     99.99695
GET       4.200     99.99713
GET       4.300     99.99754
GET       4.400     99.99795
GET       4.500     99.99871
GET       4.600     99.99924
GET       4.700    100.00000